import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:newvote/workers/databrain.dart';
import 'package:newvote/themes/theme.dart';

import '../workers/store_image.dart';

// ignore: must_be_immutable
class ContentListViewSix extends StatelessWidget {
  final Data data;
  ContentListViewSix({
    Key key,
    @required this.data,
  }) : super(key: key);

  @override
  Widget build(BuildContext context) {
    final GlobalKey<ScaffoldState> _scaffoldKey =
        new GlobalKey<ScaffoldState>();
    final copied = ClipboardData(text: "text");
    Clipboard.setData(copied);
    _showSnackBar() {
      print("Show Snackbar here !");
      final snackBar = new SnackBar(
          content: new Text("Copied to Clipboard"),
          duration: new Duration(seconds: 2),
          backgroundColor: Colors.lightBlueAccent);

      _scaffoldKey.currentState.showSnackBar(snackBar);
    }

    return Scaffold(
        key: _scaffoldKey,
        appBar: AppBar(
          leading: BackButton(color: Colors.black),
          elevation: 0,
          titleSpacing: 0.0,
          backgroundColor: AppTheme.lightTheme.primaryColor,
          title: Text(
            data.subtitle,
            style: TextStyle(fontSize: 19, color: Colors.black),
          ),
          actions: <Widget>[
            new IconButton(
              icon: Icon(
                Icons.content_copy,
                color: Colors.black,
              ),
              onPressed: _showSnackBar,
            )
          ],
        ),
        body: Container(
          color: Colors.white,
          child: ListView(
            padding: EdgeInsets.all(8.0),
            children: <Widget>[
              Text(
                data.title,
                textAlign: TextAlign.center,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text(
                "(က) ၁၉၄၇ ခုနှစ် ဖွဲ့စည်းပုံအခြေခံဥပဒေ",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""
     
    အင်္ဂလိပ်လက်အောက်မှ လွတ်လပ်ရေးရယူပြီး နိုင်ငံတော် ကို စီမံအုပ်ချုပ်ရန်ရည်ရွယ်၍ ၁၉၄၇ ခုနှစ် ဖေဖေါ်ဝါရီလ (၁၂) ရက်နေ့တွင် ရေးထိုးခဲ့သော ပင်လုံစာချုပ် အပေါ်အခြေခံပြီး ၁၉၄၇ ခုနှစ် ဖွဲ့စည်းပုံ အခြေခံ ဥပဒေကို ရေးဆွဲခဲ့ပါသည်။
ထိုဖွဲ့စည်းပုံအခြေခံဥပဒေသည် ပါလီမန်ဒီမိုကရေစီဖွဲ့စည်းပုံအခြေခံဥပဒေဖြစ်ပြီး အုပ်ချုပ်မှု အာဏာတွင် သမ္မတ ကို နိုင်ငံတော်အကြီးအကဲ အဖြစ်သတ်မှတ်ထားပြီး အစိုးရအဖွဲ့ အကြီးအကဲမှာ ဝန်ကြီးချုပ် ဖြစ်ပါသည်။ ပါလီမန်စနစ်ဖြင့် နိုင်ငံတော်ကို အုပ်ချုပ်ခဲ့သည်။ 
ဥပဒေပြုရေးအာဏာတွင် အမျိုးသားလွှတ်တော် (Chamber of Nationalities) နှင့် ပြည်သူ့လွှတ်တော် (Chamber of Deputies) ဟူ၍ လွှတ်တော် နှစ်ရပ်ထားရှိသည်။
အမျိုးသားလွှတ်တော် (Chamber of Nationalities) တွင် စုစုပေါင်းကိုယ်စားလှယ် (၁၂၅) ဦးရှိပြီး ရှမ်းပြည်နယ်(၂၅) ဦး၊ ကချင်ပြည်နယ် (၁၂) ဦး၊ ချင်းဝိဒေသတိုင်း(၈) ဦး၊ ကရင်နီပြည်နယ်(၃) ဦး၊ ကရင် ကိုယ်စားလှယ် (၂၄) ဦး နှင့် ဗမာနယ်မြေအားလုံး ကိုယ်စား (၅၃) ဦးသတ်မှတ်ခဲ့သည်။
၁၉၅၁ ခုနှစ် ဖွဲ့စည်းပုံ အခြေခံဥပဒေ ပြင်ဆင်ချက် အက်ဥပဒေ အမှတ် (၆၂) အရ ကရင်ကိုယ်စားလှယ်ကို (၁၅) ဦး လျှော့ချပြီး ဗမာနယ်မြေအားလုံးကိုယ်စား (၆၂) ဦး တိုးမြှင့် သတ်မှတ်ခဲ့သည်။ 
ပြည်သူ့လွှတ်တော် (Chamber of Deputies) သည် အမျိုးသားလွှတ်တော် ကိုယ်စားလှယ်စုစုပေါင်း၏ (၂) ဆ ဖြစ်ရမည်ဟု သတ်မှတ်ထားပြီး လူဦးရေ အနည်းဆုံး(၃၀၀၀၀) မှ လူဦးရေ အများဆုံး (၁၀၀၀၀၀) အတွင်း ကိုယ်စားလှယ် တစ်ဦးရွေးချယ်ရမည်ဟု သတ်မှတ်ထားပါသည်။
နိုင်ငံတော်ကို ရှမ်းပြည်နယ်၊ကချင်ပြည်နယ်၊ ကရင်နီပြည်နယ်၊ ချင်းဝိဒေသတိုင်း၊ ကော်သူလေးအထူး ဒေသနှင့် ဗမာပြည်မ ဟူ၍ဖွဲ့စည်းထားသည်ကို တွေ့ရပါသည်။ 
၁၉၄၇ ခုနှစ်ဖွဲ့စည်းပုံအခြေခံဥပဒေ၏ ထူးခြားချက်မှာ အခန်း(၁၀) တွင် ရှမ်းပြည်နယ်နှင့် ကယားပြည်နယ်ကို နောင်(၁၀) နှစ်အကြာတွင် ခွဲထွက်လိုက ခွဲထွက်ပိုင်ခွင့် တရားဝင်ပြဋ္ဌာန်းပေးထားသည်ကို တွေ့ရပါသည်။
"""),
              Text(
                "(ခ) ၁၉၇၄ ခုနှစ် ဖွဲ့စည်းပုံအခြေခံဥပဒေ",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""
၁၉၆၂ ခုနှစ် တွင် တပ်မတော်မှ နိုင်ငံတော်အာဏာသိမ်းယူပြီး တော်လှန်ရေးကောင်စီ အစိုးရအဖြစ် အုပ်ချုပ်ခဲ့ သည်။ ထိုတော်လှန်ရေးကောင်စီ အစိုးရမှ ၁၉၇၄ ခုနှစ်တွင် ဖွဲ့စည်းပုံ အခြေခံဥပဒေအသစ် တစ်ခု အတည်ပြု ပြဋ္ဌာန်းခဲ့ပါသည်။ ထိုဖွဲ့စည်းပုံသည် တစ်ပါတီ ဆိုရှယ်လစ်စနစ်ကို ဖေါ်ဆောင်သော အခြေခံဥပဒေ တစ်ခုဖြစ်ပြီး နိုင်ငံတော်ကို တစ်ပြည်ထောင်စနစ်ဖြင့် တည်ဆောက်ခဲ့ပါသည်။ သမ္မတသည် နိုင်ငံတော် အကြီးအကဲ ဖြစ်ရုံ သာမက အစိုးရအဖွဲ့၏ အကြီးအကဲလည်းဖြစ်ပါသည်။
ဥပဒေပြုလွှတ်တော်ကို တစ်ရပ်သာထားရှိပြီး အခြေခံအားဖြင့် တစ်မြို့နယ်လျှင် လွှတ်တော်ကိုယ်စားလှယ် တစ်ဦးနှုန်း ရွေးချယ် သည်။ သို့သော် လူဦးရေများပြားသော မြို့နယ်များတွင် ရွေးကောက်ပွဲ ဥပဒေဖြင့် မဲဆန္ဒနယ်ကို ထပ်မံတိုးမြှင့် သတ်မှတ်နိုင်သည်။
နိုင်ငံတော်ကို တိုင်း(၇) တိုင်း၊ ပြည်နယ် (၇) ပြည်နယ်ဖြင့်ဖွဲ့စည်းခဲ့ပါသည်။ ကော်သူလေးပြည်နယ်ကို ကရင်ပြည်နယ်၊ တနင်္သာရီတိုင်း (၁) ကို မွန်ပြည်နယ်၊ တနင်္သာရီတိုင်း (၂) ကို တနင်္သာရီတိုင်း၊ ချင်းဝိဒေသတိုင်း ကို ချင်းပြည်နယ်၊ ရခိုင်းတိုင်းကို ရခိုင်ပြည်နယ် ဟူ၍ ပြောင်းလဲသတ်မှတ်ခဲ့ပြီး ကျန်ဗမာပိုင် နယ်မြေများကို လည်း တိုင်း (၇) တိုင်းအဖြစ် ဖွဲ့စည်းခဲ့ပါသည်။
"""),
              Text(
                "(ဂ) ၂၀၀၈ ခုနှစ် ဖွဲ့စည်းပုံ အခြေခံဥပဒေ",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""

၁၉၈၈ခုနှစ် စက်တင်ဘာလ (၁၈) ရက်နေ့ တွင် တပ်မတော်မှ နိုင်ငံတော်အာဏာကို သိမ်းယူပြီး ၁၉၇၄ ခုနှစ် ဖွဲ့စည်းပုံ အခြေခံဥပဒေကို ပယ်ဖျက်ခဲ့သည်။ ထို့နောက် နိုင်ငံတော်ငြိမ်ဝပ်ပိပြားမှု တည်ဆောက်ရေးအဖွဲ့ ဖွဲ့စည်းကာ တိုင်းပြည် ကို အုပ်ချုပ်ခဲ့ပါသည်။
(၁၉၉၃) ခုနှစ်မှ စတင်၍ အမျိုးသား ညီလာခံ ကျင်းပ၍ ဖွဲ့စည်းပုံအခြေခံ ဥပဒေအသစ်ကို(၁၄) နှစ်ကြာ ရေးဆွဲခဲ့သည်။ ထိုဖွဲ့စည်းပုံအခြေခံဥပဒေအသစ်ကို ၂၀၀၈ ခုနှစ်၊ မေလတွင် ပြည်လုံးကျွတ်ဆန္ဒခံယူပွဲ ကျင်းပ၍ ပြဋ္ဌာန်းအတည်ပြု ခဲ့ပါသည်။
၂၀၀၈ ခုနှစ်ဖွဲ့စည်းပုံအခြေခံဥပဒေအရ ပါတီစုံ ဒီမိုကရေစီစနစ်ကိုကျင့်သုံးခဲ့ပါသည်။ ၂၀၀၈ ဖွဲ့စည်းပုံအခြေခံဥပဒေအရ မြန်မာနိုင်ငံတွင် ပြည်သူ့လွှတ်တော်၊ အမျိုးသားလွှတ်တော်၊ တိုင်းဒေသကြီး/ ပြည်နယ်လွှတ်တော် ကိုယ်စားလှယ်များကို (၅) နှစ်တစ်ကြိမ် ပါတီစုံအထွေထွေ ရွေးကောက်ပွဲများကျင်းပ၍ ရွေးချယ်ခဲ့ပါသည်။
မြန်မာနိုင်ငံသည် ခက်မ (၃) ဖြာ မှ တစ်ခု ဖြစ်သော ဥပဒေပြု အာဏာကို ပြည်သူများမှ တိုက်ရိုက်ရွေးချယ်ပြီး ကျန်ခက်မ (၂) ဖြာ ဖြစ်သော အုပ်ချုပ်ရေးအာဏာနှင့် တရားစီရင်ရေးအာဏာတို့ကို ပြည်သူများမှ တိုက်ရိုက် ရွေးချယ်သော ဥပဒေပြု အာဏာပိုင်ဆိုင်သည့် ကိုယ်စားလှယ်များမှ တဆင့် ပြန်လည် ရွေးချယ်ပါသည်။
ပြည်သူ့လွှတ်တော်ကို တစ်မြို့နယ် ၁ ဦးနှုန်းဖြင့် စုစုပေါင်း မြို့နယ် ၃၃၀ အတွက် ကိုယ်စားလှယ် ၃၃၀ ကို ရွေးချယ်ပြီး ကာကွယ်ရေးဦးစီးချုပ်မှ အမည်စာရင်းတင်သွင်းသော တပ်မတော်သားကိုယ်စားလှယ် ၁၁၀ ဦး စုစုပေါင်း ၄၄၀ ဦးရှိပါသည်။
အုပ်ချုပ်ရေးကဏ္ဍတွင် သမ္မတသည် နိုင်ငံတော်အကြီးအကဲ ဖြစ်သလို အစိုးရအဖွဲ့၏ အကြီးအကဲလည်းဖြစ်ပါသည်။ သမ္မတစနစ် နိုင်ငံများကဲ့သို့ သမ္မတကို ပြည်သူမှ တိုက်ရိုက်ရွေးကောက်ခြင်းမဟုတ်ပဲ ပြည်သူများမှ ရွေးချယ်သောလွှတ်တော် ကိုယ်စားလှယ်များနှင့် တပ်မတော်မှခန့်အပ်သော တပ်မတော်ကိုယ်စားလှယ်များမှ ရွေးချယ်သောစနစ် ဖြစ်ပါ သည်။
တရားစီရင်ရေးအာဏာအတွက် ပြည်ထောင်စုတရားလွှတ်တော်ချုပ်၊ ဖွဲ့စည်းပုံအခြေခံဥပဒေဆိုင်ရာအငြင်းပွားမှု များအတွက် နိုင်ငံတော်ဖွဲ့စည်းပုံအခြေခံဥပဒေဆိုင်ရာခုံရုံး နှင် တပ်မတော်သားများအတွက် စစ်ဘက်ဆိုင်ရာ တရားရုံး တို့ဖွဲ့စည်းထားပါသည်။
နိုင်ငံတော်ကို တိုင်းဒေသကြီး၊ပြည်နယ်၊ပြည်ထောင်စုနယ်မြေ၊ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရတိုင်း၊ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရ ဒေသ တို့ဖြင့် ဖွဲ့စည်းတည်ဆောက်ထားပါသည်။ 
    • တိုင်းဒေသကြီး (၇) ခု၊ ပြည်နယ် (၇) ခု
    • ပြည်ထောင်စုနယ်မြေ (နေပြည်တော်ကောင်စီ)
    • ဝ ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရတိုင်း
    • ဓနု ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရနယ်မြေ
    • ပအို့ဝ် ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရနယ်မြေ
    • ပလောင် ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရနယ်မြေ
    • ကိုးကန့် ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရနယ်မြေ
    • နာဂကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရနယ်မြေ
"""),
              Text(
                "အုပ်ချုပ်ရေးအာဏာ",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""

    • သမ္မတ
    • ဒုတိယသမ္မတ
    • ပြန်ထောင်စု ဝန်ကြီးများ
    • ပြည်ထောင်စု ရှေ့နေချုပ်
    """),
              Text("သမ္မတ၏ အရည်အချင်းများ",
                  style: TextStyle(fontWeight: FontWeight.bold)),
              Text("""

    • နိုင်ငံတော်နှင့် နိုင်ငံသားများအပေါ် သစ္စာရှိသူ
    • မိမိနှင့် မိမိ၏ မိဘနှစ်ပါးလုံး နိုင်ငံတော်၏ အာဏာပိုင်နက်အတွင်းတွင် မွေးဖွားသော တိုင်းရင်းသားမှ ဖြစ်သည့် မြန်မာနိုင်ငံသားဖြစ်သူ
    • ရွေးကောက်တင်မြှောက်ခံရသူသည် အနည်းဆုံးအသက် (၄၅) နှစ် ပြည့်ပြီးသူ
    • နိုင်ငံရေး၊ အုပ်ချုပ်ရေး၊ စီးပွားရေး၊ စစ်ရေးစသည့် အမြင်များရှိသူ
    • သမ္မတအဖြစ် ရွေးချယ်တင်မြှောက်ခံရသည့် အချိန်နှင့် တစ်ဆက်တည်းအနည်းဆုံး အနှစ် (၂၀) နိုင်ငံတော်တွင် အခြေချနေထိုင်ခဲ့သူ
    • လွှတ်တော်ရွေးကောက်ပွဲ၌ ရွေးကောက်တင်မြှောက်ခံပိုင်ခွင့်အတွက် သတ်မှတ်ထားသည့် အရည်အချင်း များနှင့် ပြည့်စုံသူ

ကာကွယ်ရေးဝန်ကြီး၊ ပြည်ထဲရေးဝန်ကြီး၊ နယ်စပ်လုံခြုံရေးဝန်ကြီး (၃) ဦး၏ အမည်စာရင်းအား တပ်မတော် ကာကွယ်ရေးဦးစီးချုပ်မှ သမ္မတထံတင်သွင်း၍ အခြားဝန်ကြီးများအား သမ္မတမှ ရွေးချယ်ခန့်အပ်ပြီး ပြည်ထောင်စု လွှတ်တော်မှ အတည်ပြုသည်။
                 """),
              Text(
                "ပြည်သူ့လွှတ်တော် ကိုယ်စားလှယ်များ၏ အရည်အချင်း",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""
              
အသက်(၂၅)နှစ်ပြည့်ပြီးသူ
နိုင်ငံသားမိဘနှစ်ပါးမှ မွေးဖွားလာသော နိုင်ငံသားဖြစ်သူ
ကိုယ်စားလှယ်အဖြစ် ရွေးကောက်တင် မြှောက်ခံရသည့်အချိန်နှင့် တစ်ဆက်တည်း ပြည်ထောင်စုမြန်မာနိုင်ငံတွင် အနည်းဆုံး (၁၀) နှစ် အခြေချနေထိုင်ခဲ့သူ
"""),
              Text(
                "အမျိုးသားလွှတ်တော် ကိုယ်စားလှယ် များ၏ အရည်အချင်း",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""

အသက် (၃၀) နှစ် ပြည့်ပြီးသူ
အသက် ကန့်သတ်ချက်မှအပ ပုဒ်မ (၁၂၀) အရ ရွေးကောက်တင်မြှောက်ခံပိုင်ခွင့်ရှိသော အရည်အချင်းများနှင့် ပြည့်စုံရမည်။
ပုဒ်မ (၁၂၁) တွင် ဖော်ပြထားသည့် ကိုယ်စားလှယ် အဖြစ် ရွေးကောက်တင်မြှောက်ခံပိုင်ခွင့် မရှိစေသော ပြဋ္ဌာန်းချက်များနှင့်လည်း သက်ဆိုင်စေရမည်။
တပ်မတော်သား လွှတ်တော် ကိုယ်စားလှယ်များ၏ အရည်အချင်း
တပ်မတော်သားကာကွယ်ရေး ဦးစီးချုပ်က ဥပဒေနှင့်အညီ အမည် စာရင်းတင်သွင်းသော တပ်မတော် သားများသည် ပြည်သူ့လွှတ်တော်/ အမျိုးသားလွှတ်တော် ကိုယ်စားလှယ်များအတွက် သတ်မှတ် ထားသော အရည်အချင်းများနှင့် ပြည့်စုံရမည်။
"""),
              Container(
                child: FlatButton(
                  padding: EdgeInsets.symmetric(vertical: 5.0),
                  onPressed: () {
                    Navigator.of(context).pushNamed(
                      '/fullscreen',
                      arguments: ImageStore('images/contentSeven/imageTwo.jpg'),
                    );
                  },
                  child: Image(
                    image: AssetImage('images/contentSeven/imageTwo.jpg'),
                  ),
                ),
              ),
              Container(
                child: FlatButton(
                  padding: EdgeInsets.symmetric(vertical: 5.0),
                  onPressed: () {
                    Navigator.of(context).pushNamed(
                      '/fullscreen',
                      arguments:
                          ImageStore('images/contentSeven/imageThree.png'),
                    );
                  },
                  child: Image(
                    image: AssetImage('images/contentSeven/imageThree.png'),
                  ),
                ),
              ),
              Text(
                "ပြည်နယ်နှင့် တိုင်းဒေသကြီးအစိုးရ၊လွှတ်တော် နှင့် တရားလွှတ်တော်များဖွဲ့စည်းပုံ",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""
              
	ပြည်နယ်နှင့် တိုင်းဒေသကြီး အစိုးရအဖွဲ့ကို ဝန်ကြီးချုပ် တစ်ဦးမှ ဦးဆောင်ဖွဲ့စည်းထားပါသည်။ ပြည်နယ်နှင့် တိုင်းဒေသကြီးဝန်ကြီးချုပ်များသည် သက်ဆိုင်ရာပြည်နယ်နှင့် တိုင်းဒေသကြီး လွှတ်တော်ကိုယ်စားလှယ် ဖြစ်ရန်လိုအပ် ပါသည်။ 
	ပြည်နယ်နှင့်တိုင်းဒေသကြီးဝန်ကြီးချုပ်ကို သက်ဆိုင်ရာပြည်နယ်နှင့်တိုင်းဒေသကြီး လွှတ်တော်ကိုယ်စားလှယ်များ၊ မဲဆန္ဒရှင်ပြည်သူများမှ ရွေးချယ်ခြင်းမဟုတ်ပဲ နိုင်ငံတော်သမ္မတ မှ ရွေးချယ်ပြီး သက်ဆိုင်ရာ ပြည်နယ်နှင့်တိုင်းဒေသကြီး လွှတ်တော်များမှ အတည်ပြုရပါသည်။ ၂၀၀၈ ခုနှစ်ဖွဲ့စည်းပုံ အခြေခံ ဥပဒေပါ ပြည်နယ်နှင့်တိုင်းဒေသကြီးဝန်ကြီးချုပ် တစ်ယောက်အတွက် သတ်မှတ်ထားသော အရည်အချင်းများနှင့် မပြည့်စုံပါက သမ္မတ အဆိုတင် သွင်းသော လွှတ်တော် ကိုယ်စားလှယ်ကို ဝန်ကြီးချုပ် အဖြစ်ခန့်အပ်ရန် သက်ဆိုင်ရာလွှတ်တော်မှ ငြင်းပယ်နိုင်ပါသည်။
	ပြည်နယ်နှင့်တိုင်းဒေသကြီးဝန်ကြီးများကို သက်ဆိုင်ရာဝန်ကြီးချုပ်မှ သတ်မှတ်အရည်အချင်းနှင့် ပြည့်စုံသူများကို လွှတ်တော်ကိုယ်စားများ (သို့မဟုတ်) လွှတ်တော်ကိုယ်စားလှယ် မဟုတ်သူများထဲမှ ရွေးချယ်ခြင်း၊ လုံခြုံရေးနှင့် နယ်စပ်ရေးရာ ဝန်ကြီး အတွက် တပ်မတော်ကာကွယ်ရေးဦးစီးချုပ်ထံမှ လူစာရင်းတောင်းခံခြင်း၊ မိမိပြည်နယ်တိုင်းအတွင်း ရှိ ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရ တိုင်းဦးစီးအဖွဲ့ သို့မဟုတ် ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ ဦးစီးအဖွဲ့ထံမှ ၎င်းတို့၏ ဥက္ကဋ္ဌ အမည်စာရင်းကို ရယူပြီးနောက် မိမိသက်ဆိုင်ရာ ပြည်နယ်နှင့် တိုင်းဒေသကြီးလွှတ်တော် ကိုတင်သွင်း၍ သဘောတူညီချက် ရယူပြီး နိုင်ငံတော်သမ္မတထံ တင်ပြရမည်။ နိုင်ငံတော်သမ္မတမှ သက်ဆိုင်ရာဝန်ကြီးချုပ်များနှင့်ညှိနှိုင်း၍ တင်ပြလာသော သူများကို တာဝန်ယူရမည့် ဝန်ကြီးဌာနများသတ်မှတ်၍ခန့်အပ်ပေးရမည်။
	ပြည်နယ်နှင့် တိုင်းဒေသကြီးအတွင်း ရွေးကောက်ခံရသော တိုင်းရင်သားလူမျိုးရေးရာလွှတ်တော်ကိုယ်စားလှယ် များကိုလည်း သက်ဆိုင်ရာ ပြည်နယ်နှင့် တိုင်းဒေသကြီးတွင် မိမိတို့နှင့် သက်ဆိုင်သော တိုင်းရင်းသားရေးရာ ဝန်ကြီးများအဖြစ် ခန့်အပ်တာဝန်ပေးရမည်။
  ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရတိုင်းဦးစီးအဖွဲ့နှင့် ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသဦးစီးအဖွဲ့ကို အနည်းဆုံး အဖွဲ့ဝင်ဦးရေ (၁၀) ဦးဖြင့် ဖွဲ့စည်းသည်။ ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရတိုင်း သို့မဟုတ် ဒေသ များအတွင်းရှိ မြို့နယ်များမှ သက်ဆိုင်ရာ ပြည်နယ်၊ တိုင်းဒေသကြီး အတွက် ရွေးချယ်ခံရသော လွှတ်တော်ကိုယ်စားလှယ်များ၊ လုံခြုံရေး သို့မဟုတ် နယ်စပ်ရေးရာအတွက် တာဝန်ပေးအပ်နိုင်ရန် တပ်မတော်ကာကွယ်ရေးဦးစီးချုပ်မှ အမည်စာရင်းတင်သွင်းသော တပ်မတော်သား ကိုယ်စားလှယ်များ နှင့် ၎င်းတို့မှ ရွေးချယ်ဖြည့်စွက် ခန့်ထားသည့် ကိုယ်စားလှယ်များ ဖြင့် ဖွဲ့စည်းရမည်။	 ထိုအဖွဲ့ဝင်များထဲမှ သင့်လျှော်သော သူတစ်ဦး ကို ဥက္ကဋ္ဌ အဖြစ် ရွေးချယ်ရမည်။ ထိုဥက္ကဋ္ဌ သည် သက်ဆိုင်ရာ ပြည်နယ် တိုင်းဒေသကြီး၏ ဝန်ကြီး ဖြစ်သည်။ တပ်မတော်ကာကွယ်ရေးဦးစီးချုပ်သည် ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရတိုင်း/ဒေသ ဦးစီးအဖွဲ့တွင် ဦးစီးအဖွဲ့ဝင် စုစုပေါင်း၏ လေးပုံ တစ်ပုံကို တပ်မတော်ကို လိုအပ်သလို ဖြည့်စွက်တာဝန်ပေးနိုင်သည်။
  ပြည်နယ်နှင့် တိုင်းဒေသကြီး လွှတ်တော်ကို  မိမိပြည်နယ်နှင့် တိုင်းဒေသကြီး အတွင်းမြို့နယ်များမှ တစ်မြို့နယ်လျှင် ကိုယ်စားလှယ် (၂) ဦးနှုန်းဖြင့် ရွေးချယ် ထားသော လွှတ်တော်ကိုယ်စားလှယ်များ၊ ပြည်နယ်၊ တိုင်းဒေသကြီးရရှိပြီးသော သို့မဟုတ် ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရတိုင်း၊ ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသရရှိပြီးသော တိုင်းရင်းသား လူမျိုးမှ အပ နိုင်ငံတော်လူဦးရေ၏ ၀.၁ % နှင့် အထက်ရှိသော ကျန်တိုင်းရင်းသားလူမျိုးများမှ လူမျိုးတစ်မျိုးလျှင် တစ်ဦးကျ ရွေးချယ်သော ပြည်နယ်နှင့် တိုင်းဒေသကြီးလွှတ်တော်ကိုယ်စားလှယ်များ၊ အထက်ပါပြည်သူများ၊ တိုင်းရင်းသားလူမျိုးစုများမှ ရွေးချယ်ထားသော လွှတ်တော်ကိုယ်စားလှယ် စုစုပေါင်း၏ သုံးပုံ တစ်ပုံနှင့် ညီမျှသော တပ်မတော် ကာကွယ်ရေး ဦးစီးချုပ်မှ အမည်စာရင်သွင်းသော တပ်မတော်သားကိုယ်စားလှယ်များစုပေါင်း၍ ဖွဲ့စည်းပါသည်။
  ပြည်နယ်နှင့်တိုင်းဒေသကြီးတရားလွှတ်တော်ကို ပြည်နယ် သို့မဟုတ် တိုင်းဒေသကြီး တရားသူကြီးချုပ် အပါအဝင် တရားသူကြီး အနည်းဆုံး (၃) ဦးမှ အများဆုံး (၇) ဦးထိခန့်အပ်သည်။ နိုင်ငံတော်သမ္မတသည် ပြည်ထောင်စု တရားသူကြီးချုပ်၊ သက်ဆိုင်ရာ ပြည်နယ်၊တိုင်းဒေသကြီး ဝန်ကြီးချုပ်တို့နှင့် တိုင်ပင်၍ ပြည်နယ်သို့မဟုတ် တိုင်းဒေသကြီး တရားသူကြီးချုပ် နှင့် တရားသူကြီးအဖွဲ့ဝင်များကို ရွေးချယ်၍ သက်ဆိုင်ရာ ပြည်နယ်၊တိုင်းဒေသကြီး လွှတ်တော်ကို ပေးပို့ကာ အတည်ပြုချက်ရယူပါသည်။ 
  ပြည်နယ်နှင့်တိုင်းတရားသူကြီးများ၏ သက်တမ်းသည် အသက် (၄၅) နှစ်မှ အသက် (၆၅) နှစ် အထိရှိသောကြောင့် အများဆုံး အနှစ် (၂၀) အထိ တာဝန်ထမ်းဆောင်နိုင်ပါသည်။

              """)
            ],
          ),
        ));
  }
}
