import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:newvote/workers/databrain.dart';
import 'package:newvote/themes/theme.dart';

import '../workers/store_image.dart';

// ignore: must_be_immutable
class ContentListViewSeven extends StatelessWidget {
  final Data data;
  ContentListViewSeven({
    Key key,
    @required this.data,
  }) : super(key: key);
  @override
  Widget build(BuildContext context) {
    final GlobalKey<ScaffoldState> _scaffoldKey =
        new GlobalKey<ScaffoldState>();
    final copied = ClipboardData(text: "text");
    Clipboard.setData(copied);
    _showSnackBar() {
      print("Show Snackbar here !");
      final snackBar = new SnackBar(
          content: new Text("Copied to Clipboard"),
          duration: new Duration(seconds: 2),
          backgroundColor: Colors.lightBlueAccent);

      _scaffoldKey.currentState.showSnackBar(snackBar);
    }

    return Scaffold(
        key: _scaffoldKey,
        appBar: AppBar(
          leading: BackButton(color: Colors.black),
          elevation: 0,
          titleSpacing: 0.0,
          backgroundColor: AppTheme.lightTheme.primaryColor,
          title: Text(
            data.subtitle,
            style: TextStyle(fontSize: 19, color: Colors.black),
          ),
          actions: <Widget>[
            new IconButton(
              icon: Icon(
                Icons.content_copy,
                color: Colors.black,
              ),
              onPressed: _showSnackBar,
            )
          ],
        ),
        body: Container(
          color: Colors.white,
          child: ListView(
            padding: EdgeInsets.all(8.0),
            children: <Widget>[
              Text(
                data.title,
                textAlign: TextAlign.center,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text(
                  '၂၀၀၈ခုနှစ်ဖွဲ့စည်းပုံအခြေခံဥပဒေအရ မြန်မာနိုင်ငံ၏ လွှတ်တော်အသီးသီးအတွက် ရွေးကောက်ပွဲများကို (၅) နှစ် တစ်ကြိမ် ကျင်းပမည်ဟုပြဋ္ဌာန်းထားပါသည်။ ထိုရွေးကောက်ပွဲများကို ကြီးကြပ်စီမံအုပ်ချုပ်ရန်အတွက် ရွေးကောက်ပွဲ ကော်မရှင်ကို အောက်ပါအတိုင်းဖွဲ့စည်းရမည်ဟုလည်း ပြဋ္ဌာန်းထားသည်။'),
              Text(
                '၁။ရွေးကောက်ပွဲကော်မရှင်အဖွဲ့ဝင်များအား ရွေးချယ်ခန့်အပ်ပေးမှု',
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""
            ပြည်ထောင်စုသမ္မတ မြန်မာနိုင်ငံတော် ဖွဲ့စည်းပုံအခြေခံဥပဒေ (၂၀၀၈) ခုနှစ်၏အခန်း(၉) ရွေးကောက် တင်မြှောက် ခြင်း အခန်းတွင် ပြည်ထောင်စုရွေးကောက်ပွဲ ကော်မရှင်ဖွဲ့စည်းခြင်းကို ပုဒ်မ ၃၉၈ တွင်(က)နှင့် (ခ) တို့တွင်ပြဋ္ဌာန်း ထားသည်ကိုတွေ့ရပါသည်။ ကော်မရှင်ဥက္ကဋ္ဌအပါအဝင် အဖွဲ့ဝင်အနည်းဆုံး  (၅) ဦးကို နိုင်ငံတော် သမ္မတမှ ခန့်အပ်တာဝန်ပေးပိုင်ခွင့်ရှိပြီး ပြည်ထောင်စုလွှတ်တော်၏ သဘောတူညီချက်ကို ရယူရပါမည်။ ပုဒ်မ(ခ)တွင် ရွေးကောက်ပွဲ ကော်မရှင်ဥက္ကဋ္ဌနှင့် အဖွဲ့ဝင်များ၏ အရည်အချင်းကို အသေးစိတ်ဖေါ်ပြထားပါသည်။
ပုဒ်မ (၃၉၈)
    (က)နိုင်ငံတော်သမ္မတသည်ပြည်ထောင်စုရွေးကောက်ပွဲကော်မရှင်တစ်ရပ်ကိုဖွဲ့စည်းရမည်။ယင်းသို့ဖွဲ့စည်းရာတွင်ဤဖွဲ့စည်းပုံ အခြေခံဥပဒေပါ ပြည်ထောင်စုဝန်ကြီးခန့်ထားခြင်းနှင့် စပ်လျဉ်းသည့် ပြဋ္ဌာန်းချက်များနှင့် အညီ ပြည်ထောင်စုရွေးကောက်ပွဲ ကော်မရှင်ဥက္ကဋ္ဌအပါအဝင်အဖွဲ့ဝင် အနည်းဆုံးငါးဦးကိုခန့်အပ်တာဝန် ပေးနိုင်သည်။
    (ခ) ပြည်ထောင်စုရွေးကောက်ပွဲကော်မရှင်ဥက္ကဋ္ဌနှင့် အဖွဲ့ဝင်များသည်
    (၁)	အသက် ၅၀ နှစ် ပြည့်ပြီးသူဖြစ်ရမည်။
    (၂)	အသက်ကန့်သတ်ချက်မှအပ ပြည်သူ့လွှတ်တော်ကိုယ်စားလှယ်များအတွက်  သတ်မှတ်ထားသည့် အရည်အချင်းများနှင့် ပြည့်စုံသူဖြစ်ရမည်။
(၃)	(ကက) ပြည်ထောင်စုတရားသူကြီးချုပ် သို့မဟုတ် ပြည်ထောင်စုတရားလွှတ်တော်ချုပ် 
              တရားသူကြီး အဖြစ်ဖြစ်စေ၊ တိုင်းဒေသကြီး သို့မဟုတ် ပြည်နယ်တရားလွှတ်တော်   
              တရားသူကြီး အဖြစ် ဖြစ်စေ၊ အလားတူ ရာထူးတာဝန်တစ်ခုခုတွင်ဖြစ်စေ အနည်းဆုံး ငါးနှစ် 
              ဆောင်ရွက်ခဲ့သူဖြစ်ရမည် သို့မဟုတ် 
    (ခခ) တိုင်းဒေသကြီး သို့မဟုတ် ပြည်နယ်အဆင့်ထက်မနိမ့်သော တရားရေးအရာရှိ သို့မဟုတ် ဥပဒေအရာရှိ ရာထူးတွင် အနည်းဆုံး ၁၀ နှစ် တာဝန်ထမ်းဆောင်ခဲ့သူဖြစ်ရမည် သို့မဟုတ်
    (ဂဂ) တရားလွှတ်တော်ရှေ့နေအဖြစ် အနည်းဆုံး ၂၀ နှစ် အမှုလိုက်ပါ ဆောင်ရွက်ခဲ့သူ ဖြစ်ရမည် သို့မဟုတ် 
    (ဃဃ) ထင်ပေါ်ကျော်ကြားသည့် ဂုဏ်သတင်းရှိသော ပုဂ္ဂိုလ်အဖြစ် နိုင်ငံတော်သမ္မတက ယူဆသူ ဖြစ်ရမည်။
(၄)	သိက္ခာသမာဓိနှင့် ပြည့်စုံပြီး အတွေ့အကြုံရင့်ကျက်သူဖြစ်ရမည်။
(၅)	ပြည်သူ့လွှတ်တော်ကိုယ်စားလှယ်အဖြစ် ရွေးကောက်တင်မြှောက်ခံပိုင်ခွင့်မရှိသော ပြဋ္ဌာန်းချက်များနှင့် 	ငြိစွန်းခြင်းမရှိသူ ဖြစ်ရမည်။
(၆)	နိုင်ငံတော်နှင့် နိုင်ငံသားများအပေါ် သစ္စာရှိသူဖြစ်ရမည်။
(၇)	နိုင်ငံရေးပါတီဝင်မဟုတ်သူဖြစ်ရမည်။
(၈)	လွှတ်တော်ကိုယ်စားလှယ်မဟုတ်သူဖြစ်ရမည်။
(၉)	လစာ၊ စရိတ်၊ ကြေးငွေရသော အခြားမည်သည့်ရာထူးကိုမျှ လက်ခံခြင်းမပြုသူ ဖြစ်ရမည်။
"""),
              Text("၂ ။ ပြည်ထောင်စု ရွေးကောက်ပွဲ ကော်မရှင်၏ လုပ်ငန်းတာဝန်များ",
                  style: TextStyle(fontWeight: FontWeight.bold)),
              Text("""
ဖွဲ့စည်းပုံအခြေခံဥပဒေ ပုဒ်မ (၃၉၉) တွင် ရွေးကောက်ပွဲ ကော်မရှင်၏ လုပ်ငန်းတာဝန်များကို အောက်ပါအတိုင်း ဖေါ်ပြထားသည်ကိုလည်းတွေ့ရှိရပါသည်။
  	(က)လွှတ်တော်ရွေးကောက်ပွဲများကျင်းပခြင်း၊
	  (ခ) လွှတ်တော်ရွေးကောက်ပွဲများကြီးကြပ်ခြင်း၊ ကော်မရှင်အဖွဲ့ခွဲအဆင့်ဆင့်ကိုဖွဲ့စည်းခြင်းနှင့် ကြီးကြပ်စေခြင်း၊
	  (ဂ)  မဲဆန္ဒနယ်များသတ်မှတ်ခြင်းနှင့် ပြင်ဆင်သတ်မှတ်ခြင်း၊
	  (ဃ) မဲစာရင်းများပြုစုခြင်းနှင့် ပြင်ဆင်ခြင်း၊
	  (င)  သဘာဝဘေးအန္တရယ်ကြောင့် သော်လည်းကောင်း၊ နယ်မြေလုံခြုံရေးအခြေအနေအရ သော်လည်း  ကောင်း လွတ်လပ်ပြီးတရားမျှတသော ရွေးကောက်ပွဲ ကျင်းပနိုင်ခြင်းမရှိသည့် မဲဆန္ဒနယ်များ၏ ရွေးကောက်ပွဲများကို ရွှေ့ဆိုင်းခြင်း၊
	  (စ) ရွေးကောက်ပွဲဆိုင်ရာ သို့မဟုတ် နိုင်ငံရေးပါတီများဆိုင်ရာ နည်းဥပဒေများကို ဤဖွဲ့စည်းပုံအခြေခံဥပဒေပါ ပြဋ္ဌာန်းချက်များနှင့်အညီ လည်းကောင်း၊ လုပ်ထုံးလုပ်နည်းများ၊ ညွှန်ကြားချက်စသည့်များ ကို သက်ဆိုင်ရာ ဥပဒေများနှင့် အညီလည်းကောင်း ထုတ်ပြန်ခြင်း၊
	  (ဆ) ရွေးကောက်ပွဲဆိုင်ရာ အငြင်းပွားမှုများကို စစ်ဆေးနိုင်ရေးအတွက် ဥပဒေနှင့်အညီ ရွေးကောက်ပွဲ  ခုံအဖွဲ့များ ဖွဲ့စည်းခြင်း၊
    (ဇ) ဥပဒေတစ်ရပ်ရပ်အရ ပေးအပ်သည့်တာဝန်များကို ထမ်းဆောင်ခြင်း၊

ထို့အပြင်ပုဒ်မ(၄၀၂)ပုဒ်မခွဲ(က)နှင့်(ခ)တွင်ပြည်ထောင်စုရွေးကောက်ပွဲကော်မရှင်၏ဆုံးဖြတ်ချက်နှင့်ဆောင်ရွက် ချက်များကို ပြဋ္ဌာန်းထားပြီး ထိုလုပ်ငန်းများနှင့် ပါတ်သက်၍ ပြည်ထောင်စုရွေးကောက်ပွဲ ကော်မရှင်၏ ဆောင်ရွက်ချက်နှင့် ဆုံးဖြတ်ချက်များသည် အပြီးအပြတ် အတည်ဖြစ်စေရမည်ဟု ဖေါ်ပြထားပါသည်။
	(က) ရွေးကောက်တင်မြှောက်ခြင်းဆိုင်ရာလုပ်ငန်းများ
	(ခ) ရွေးကောက်ပွဲခုံအဖွဲ့များ၏ဆုံးဖြတ်ချက်များ၊ အမိန့်များနှင့်စပ်လျဉ်းသည့် အယူခံမှုများနှင့် ပြင်ဆင်မှုများ၊
	(ဂ)  နိုင်ငံရေးပါတီဆိုင်ရာ ဥပဒေအရဆောင်ရွက်သော ကိစ္စရပ်များ၊

            """),
              Text(
                'ရွေးကောက်ပွဲကော်မရှင်၏သက်တမ်း',
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""
            ​ရွေးကောက်ပွဲကော်မရှင်၏ သက်တမ်းကို သီးခြားဖေါ်ပြထားခြင်းမရှိသော်လည်း နိုင်ငံတော်သမ္မတသည် ပြည်ထောင်စုရွေးကောက်ပွဲ ကော်မရှင်တစ်ရပ်ကို ဖွဲ့စည်းရမည်ဟု ပြဋ္ဌာန်းထားသောကြောင့် ကော်မရှင်၏ သက်တမ်းသည် သမ္မတ၏ သက်တမ်းနှင့် အတူတူဖြစ်ပါသည်။ နိုင်ငံတော်သမ္မတ၏သက်တမ်းသည် (၅) နှစ်ဖြစ်သောကြောင့် ရွေးကောက်ပွဲ ကော်မရှင်သက်တမ်းသည်လည်း (၅) နှစ်ဖြစ်ပါသည်။ ၂၀၂၀ ရွေးကောက်ပွဲတွင် ဦးဆောင်ကျင်းပမည့် ရွေးကောက်ပွဲကော်မရှင်ဥက္ကဋ္ဌနှင့် အဖွဲ့ဝင်များ ၂၀၁၆ ခုနှစ်တွင် နိုင်ငံတော်သမ္မသည် ဥက္ကဌဦးလှသိန်း ဦးဆောင်၍ အဖွဲ့ဝင် (၁၄) ဦးပါဝင်သည့် ပြည်ထာင်စု ရွေးကောက်ပွဲကော်မရှင်ကို အောက်ပါအတိုင်း ဖွဲ့စည်းခဲ့သည်။
            """),
              Table(
                border: TableBorder.all(color: Colors.black),
                children: [
                  TableRow(children: [
                    TableCell(child: Text('(၁) ဦးလှသိန်း')),
                    TableCell(
                      child: Text('ဥက္ကဋ္ဌ'),
                    ),
                    TableCell(child: Text('(၉) ဦးသက်ထွန်း')),
                    TableCell(child: Text('အဖွဲ့ဝင်')),
                  ]),
                  TableRow(children: [
                    TableCell(child: Text('(၂) ဦးအောင်မြင့်')),
                    TableCell(
                      child: Text('အဖွဲ့ဝင်'),
                    ),
                    TableCell(child: Text('(၁၀) ဦးမြင့်အောင်')),
                    TableCell(child: Text('အဖွဲ့ဝင်')),
                  ]),
                  TableRow(children: [
                    TableCell(child: Text('(၃‌) ဦးစိုးရယ်')),
                    TableCell(
                      child: Text('အဖွဲ့ဝင်'),
                    ),
                    TableCell(child: Text('(၉) ဦးစောဒယ်နီရယ်ကြည်')),
                    TableCell(child: Text('အဖွဲ့ဝင်')),
                  ]),
                  TableRow(children: [
                    TableCell(child: Text('(၄) ဦးထွန်းခင်')),
                    TableCell(
                      child: Text('အဖွဲ့ဝင်'),
                    ),
                    TableCell(child: Text('(၁၂) ဦးအောင်စိုးဝင်း')),
                    TableCell(child: Text('အဖွဲ့ဝင်')),
                  ]),
                  TableRow(children: [
                    TableCell(child: Text('(၅) ဦးလှတင့်')),
                    TableCell(
                      child: Text('အဖွဲ့ဝင်'),
                    ),
                    TableCell(child: Text('(၁၃) ဦးသန်းအောင်')),
                    TableCell(child: Text('အဖွဲ့ဝင်')),
                  ]),
                  TableRow(children: [
                    TableCell(child: Text('(၆) ဦးမြင့်နိုင်')),
                    TableCell(
                      child: Text('အဖွဲ့ဝင်'),
                    ),
                    TableCell(child: Text('(၁၄) ဦးမင်းဆွေ')),
                    TableCell(child: Text('အဖွဲ့ဝင်')),
                  ]),
                  TableRow(children: [
                    TableCell(child: Text('(၇) ဦးသန်းဌေး')),
                    TableCell(
                      child: Text('အဖွဲ့ဝင်'),
                    ),
                    TableCell(child: Text('(၁၅) ဦးဆွေတင့်လွင်')),
                    TableCell(child: Text('အဖွဲ့ဝင်')),
                  ]),
                  TableRow(children: [
                    TableCell(child: Text('(၈) ဦးညွန့်စိန်')),
                    TableCell(
                      child: Text('အဖွဲ့ဝင်'),
                    ),
                    TableCell(child: Text('(၁၆) ဦးခင်မောင်ဦး')),
                    TableCell(child: Text('ညွှန်ကြားရေးမှူးချုပ်')),
                  ]),
                ],
              ),
              Padding(
                padding: const EdgeInsets.all(8.0),
                child: FlatButton(
                  onPressed: () {
                    Navigator.of(context).pushNamed(
                      '/fullscreen',
                      arguments: ImageStore('images/contentEight/imageOne.jpg'),
                    );
                  },
                  child: Image(
                    image: AssetImage('images/contentEight/imageOne.jpg'),
                  ),
                ),
              ),
              Text("""
              ၂၀၀၈ ဖွဲ့စည်းပုံအခြေခံဥပဒေ အခန်း(၁) နိုင်ငံတော်အခြေခံမူများအခန်း၏ပုဒ်မ (၃၈) တွင်
(က) နိုင်ငံသားတိုင်းသည် ဥပဒေနှင့် အညီ ရွေးကောက်တင်မြှောက်ခွင့်နှင့် ရွေးကောက်တင်မြှောက်ခံပိုင်ခွင့်ရှိသည်။
(ခ) ရွေးကောက်တင်မြှောက်ထားသော ပြည်သူ့ကိုယ်စားလှယ်ကို သက်ဆိုင်ရာ မဲဆန္ဒရှင်များက ဤဖွဲ့စည်းပုံ အခြေခံဥပဒေတွင် ပြဋ္ဌာန်းထားချက်များနှင့် အညီ တာဝန်မှ ပြန်လည်ရုပ်သိမ်းခွင့် ရှိသည်။

လူ့အခွင့်အရေး ကြေညာစာတမ်း အပိုဒ် (၂၁) တွင် လူတိုင်း မိမိတိုင်းပြည်၏ အစိုးရကို ဆန္ဒမဲဖြင့် ရွေးချယ်ပိုင်ခွင့် ရှိသည်။
"""),
              Text(
                "လွှတ်တော်ကိုယ်စားလှယ်များ ရွေးချယ်ခြင်း",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""
မြန်မာနိုင်ငံအတွင်းရှိ သတ်မှတ်အရည်အချင်းနှင့်ကိုက်ညီသော မဲဆန္ဒရှင်များသည် အထွေထွေရွေးကောက်ပွဲတွင် အနည်းဆုံး အောက်ပါလွှတ်တော်များအတွက် ဆန္ဒမဲ (၃) ကြိမ် ပေးခွင့်ရှိပါသည်။
၁။ အမျိုးသားလွှတ်တော်ကိုယ်စားလှယ် တစ်ဦး ရွေးချယ်ခြင်း
၂။ ပြည်သူ့လွှတ်တော်ကိုယ်စားလှယ် တစ်ဦး ရွေးချယ်ခြင်း
၃။ ပြည်နယ် သို့မဟုတ် တိုင်းဒေသကြီး ကိုယ်စားလှယ် တစ်ဦး ရွေးချယ်ခြင်း
မိမိတိုင်းရင်းသားလူမျိုး ကိုယ်စားလှယ် တစ်ဦး အားထပ်မံ ရွေးချယ်ခြင်း
အကယ်၍မဲဆန္ဒရှင် သည် 
 မိမိနေထိုင်ရာပြည်နယ် သို့မဟုတ် တိုင်းဒေသကြီးတွင် မိမိ၏လူမျိုးသည် သတ်မှတ် ထားသော အကြောင်းအချက် များနှင့်ပြည့်မှီသောကြောင့် မိမိတိုင်းရင်းသားလူမျိုးအတွက် ကိုယ်စားလှယ်ရွေးချယ်လျှင်  နောက်ထပ် ဆန္ဒမဲ (၁) မဲကို ထပ်မံ ပေးရပါမည်။
မဲဆန္ဒရှင်ပြည်သူများ အနေဖြင့် မိမိတို့ မဲဆန္ဒပြုခွင့်ရှိသော ရွေးကောက်ပွဲများတွင် ပါဝင်ဆန္ဒပြု၍ မိမိတို့ ကိုယ်စားလှယ်များ ကို ရွေးချယ်ခြင်းဖြင့် ပြည်သူ့ကိုယ်စားပြု အုပ်ချုပ်ရေးစနစ်အတွက် စစ်မှန်သော ပြည်သူ့ ကိုယ်စားလှယ်များ ပေါ်ထွက်လာစေရန် ရွေးကောက်ပွဲများတွင် ဝင်ရောက်မဲပေးခြင်းသည် ဒီမိုကရေစီစနစ်ကို ခိုင်မာ တောင့်တင်းအောင် ဆောင်ရွက်ခြင်းပင် ဖြစ်သည်။

              """)
            ],
          ),
        ));
  }
}
