import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:newvote/workers/databrain.dart';
import 'package:newvote/themes/theme.dart';

// ignore: must_be_immutable
class ContentListViewTen extends StatelessWidget {
  final Data data;
  ContentListViewTen({
    Key key,
    @required this.data,
  }) : super(key: key);

  @override
  Widget build(BuildContext context) {
    final GlobalKey<ScaffoldState> _scaffoldKey =
        new GlobalKey<ScaffoldState>();
    final copied = ClipboardData(text: "text");
    Clipboard.setData(copied);
    _showSnackBar() {
      print("Show Snackbar here !");
      final snackBar = new SnackBar(
          content: new Text("Copied to Clipboard"),
          duration: new Duration(seconds: 2),
          backgroundColor: Colors.lightBlueAccent);

      _scaffoldKey.currentState.showSnackBar(snackBar);
    }

    return Scaffold(
        key: _scaffoldKey,
        appBar: AppBar(
          leading: BackButton(color: Colors.black),
          elevation: 0,
          titleSpacing: 0.0,
          backgroundColor: AppTheme.lightTheme.primaryColor,
          title: Text(
            data.subtitle,
            style: TextStyle(fontSize: 19, color: Colors.black),
          ),
          actions: <Widget>[
            new IconButton(
              icon: Icon(
                Icons.content_copy,
                color: Colors.black,
              ),
              onPressed: _showSnackBar,
            )
          ],
        ),
        body: Container(
          color: Colors.white,
          child: ListView(
            padding: EdgeInsets.all(8.0),
            children: <Widget>[
              Text(
                data.title,
                textAlign: TextAlign.center,
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""
ရွေးကောက်ပွဲဥပဒေအခန်း(၁၃) 
(က) ပြစ်မှုများ-
(၁)	ရွေးကောက်ပွဲပြစ်မှုများကိုရွေးကောက်ပွဲဥပဒေအခန်း (၁၃)တွင် ပုဒ်မ    (၅၇) မှ (၆၅)အထိ ပြဌာန်းထားပါသည်။
(၂)	တရားရုံးကစစ်ဆေးစီရင်သည့် အမှုများဖြစ်ပါသည်။ 
(၃)	ထောင်ဒဏ်၊ ငွေဒဏ် ချမှတ်နိုင်ပါသည်။ 
(၄)	ရဲအရေးပိုင်အမှုများ ဖြစ်ပါသည်။
(၅)	ရွေးကောက်ပွဲမကျင်းပမီသို့မဟုတ် ရွေးကောက်ပွဲကျင်းပနေစဉ် သို့မဟုတ် ရွေးကောက်ပွဲကျင်းပသောနေ့မှ ၁၅ ရက်အတွင်း တိုင်ကြားရမည်။
              """),
              Text(
                "ရွေးကောက်ပွဲဆိုင်ရာ ပြစ်မှုနှင့် ပြစ်ဒဏ်များ",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text(
                  "တစ်နှစ်ထက်မပိုသောထောင်ဒဏ်၊ သို့မဟုတ် ကျပ်တစ်သိန်းထက်မပိုသော ငွေဒဏ် သို့မဟုတ် ပြစ်ဒဏ်နှစ်ခု စလုံးချမှတ်နိုင်သော ပြစ်မှုများ။"),
              Table(
                columnWidths: {
                  0: FlexColumnWidth(3),
                  1: FlexColumnWidth(1),
                },
                border: TableBorder.all(color: Colors.black),
                children: [
                  TableRow(children: [
                    TableCell(
                        child: Text(
                      'ပြစ်မှု',
                      textAlign: TextAlign.center,
                      style: TextStyle(fontWeight: FontWeight.bold),
                    )),
                    TableCell(
                        child: Text(
                      'ပြစ်ဒဏ်',
                      textAlign: TextAlign.center,
                      style: TextStyle(fontWeight: FontWeight.bold),
                    )),
                  ]),
                  buildTableRow(
                      cell1:
                          'တစ်ဦးတစ်ယောက်၏မဲပေးခွင့်၊ ရွေးကောက်တင်မြှောက် ခံပိုင်ခွင်ကို မကျင့်သုံးစေရန် အကြမ်း ဖက်ခြင်း၊ခြိမ်းခြောက်ခြင်း၊ မလျော်ဩဇာသုံးခြင်း၊ လိမ်လည်လှည့်ဖျားခြင်း၊ လာဘ်ပေးခြင်း၊ လာဘ်ယူခြင်း ပြုလုပ်ကြောင်း ပြစ်မှုထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၇)'),
                  buildTableRow(
                      cell1:
                          'ရွေးကောက်ပွဲဆိုင်ရာ အခွင့်အရေးကို မတရားသဖြင့် ရရှိစေရန် သို့မဟုတ် ယင်းအခွင့်အရေး ရရှိခဲ့သည့်အတွက် လာဘ်ပေးခြင်း ကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီ ကြောင်း ထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၈-က)'),
                  buildTableRow(
                      cell1:
                          'ရွေးကောက်ပွဲဆိုင်ရာ အခွင့်အရေးကိုလွတ်လပ်စွာမကျင့်သုံးနိုင်ရန် ကိုယ်စားလှယ်လောင်း တစ်ဦးဦး သို့မဟုတ် ဆန္ဒမဲပေးပိုင်ခွင့်ရှိသူ တစ်ဦးဦးကို ခြိမ်းခြောက်ခြင်း ကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၈-ခ)'),
                  buildTableRow(
                      cell1:
                          'လူမျိုးရေး၊ဘာသာရေးအကြောင်းပြ၍မဲပေးရန်၊မဲမပေးရန် ပြောဆိုခြင်း၊ ဟောပြောခြင်း၊ ကြေငြာချက် ထုတ်ခြင်း၊ အားပေးလှုံ့ဆော်ခြင်း ကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၈-ဂ)'),
                  buildTableRow(
                      cell1:
                          'မဲပေးရန်ပျက်ပြားစေရန်၊ ရွေးကောက်ပွဲပျက်ပြားစေရန် စည်းဝေး ဟောပြောခြင်း၊ လှုံ့ဆော်ခြင်း၊ ပိုစတာထုတ်ခြင်း၊ရေးသားဖြန့်ချိခြင်း၊အခြားနည်းဖြင့်ကြိုးပမ်းခြင်း ကို  ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၈-ဃ)'),
                  buildTableRow(
                      cell1:
                          'ကော်မရှင်အသီးသီးမှ ထုတ်ပြန်သော စာရွက်စာတမ်းများနှင့် ရွေးကောက်ပွဲဆိုင်ရာ အခြား စာရွက် စာတမ်းများကို တမင်ကြံရွယ်ချက်ဖြင်ဖျက်ဆီးခြင်း၊ဖတ်မရအောင်ပြုလုပ်ခြင်း ကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-က)'),
                  buildTableRow(
                      cell1:
                          'မဲစာရင်း၊မဲလက်မှတ်၊ ယင်းတို့ကိုထုတ်ပိုးသောစာအိတ် သို့မဟုတ် အထုပ် တမင်ကြံရွယ်ချက် ဖြင်ဖျက်ဆီးခြင်း၊ဖတ်မရအောင်ပြုလုပ်ခြင်း ကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီ ကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-ခ)'),
                  buildTableRow(
                      cell1:
                          'ကြိုတင်မဲ သို့မဟုတ် ဆန္ဒမဲလက်မှတ်ကို မသမာသောနည်းဖြင့် အခြားသူအားပေးခြင်းကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီ ကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-ဂ)'),
                  buildTableRow(
                      cell1:
                          'မဲပုံးအတွင်းသို့ မဲလက်မှတ်မဟုတ်ဘဲ အခြားပစ္စည်းတစ်ခုခု ထည့်သွင်းခြင်းကိုကျုးလွန်ကြောင်း၊  ကျုးလွန်ရန် အားပေးကူညီ ကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-ဃ)'),
                  buildTableRow(
                      cell1:
                          'အသုံးပြုဆဲ မဲပုံးကို အခွင့်မရှိဘဲဖွင့်ခြင်း၊ မဲလက်မှတ်များကို ဖျက်ဆီးခြင်း ကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီ ကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-င)'),
                  buildTableRow(
                      cell1:
                          'လွှတ်တော်မဲဆန္ဒနယ်တစ်နယ်ထက်ပိုသော မဲဆန္ဒနယ်များအတွက် မဲပေးခြင်း ကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီ ကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-စ)'),
                  buildTableRow(
                      cell1:
                          'မိမိမဲပေးပိုင်ခွင့်ရှိသော မဲဆန္ဒနယ် လွှတ်တော်တစ်ခုအတွက် တစ်ကြိမ်ထက်ပို၍မဲပေးခြင်း ကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီ ကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-ဆ)'),
                  buildTableRow(
                      cell1:
                          'သူတစ်ပါး အယောင်ဆောင်၍ ကြိုတင်မဲ၊ ဆန္ဒမဲ လက်မှတ်ကို ထုတ်ယူခြင်း၊ မဲပေးခြင်း ကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီ ကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-ဇ)'),
                  buildTableRow(
                      cell1:
                          'ရွေးကောက်ပွဲကျင်းပနေချိန် အခွင့်မရှိဘဲ မဲရုံအတွင်းသို့ဝင်ရောက်ခြင်းကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေးကူညီ ကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-ဈ)'),
                  buildTableRow(
                      cell1:
                          'မဲလက်မှတ်အတုကို မဲပုံးအတွင်းသို့ ထည့်သွင်းခြင်းကို ကျုးလွန်ကြောင်း၊ ကျုးလွန်ရန် အားပေး ကူညီ ကြောင်းထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၅၉-ည)'),
                  buildTableRow(
                      cell1:
                          'ရွေးကောက်ပွဲကျင်းပသည့်နေ့တွင် မဲရုံအတွင်း၊ မဲရုံမှ ကိုက် ၅၀၀ အကွာအတွင်း မဲဆွယ်ခြင်း ကို ကျုးလွန်လျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၆၀)'),
                  buildTableRow(
                      cell1:
                          'ရွေးကောက်ပွဲကျင်းပသည့်နေ့တွင် မဲရုံအတွင်း၊ မဲရုံမှ ကိုက် ၅၀၀ အကွာအတွင်း မဲပေးမည့်သူတစ်ဦးဦးကို မည်သူ့ကိုမဲပေးရန်တောင်းဆိုခြင်း သို့မဟုတ် မဲမပေးရန် တိုက်တွန်း သွေးဆောင်ခြင်း ကို ကျုးလွန်လျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၆၁ က)'),
                  buildTableRow(
                      cell1:
                          'တစ်ဦးတစ်ယောက်၏မဲပေးခွင့်၊ ရွေးကောက်တင်မြှောက် ခံပိုင်ခွင်ကို မကျင့်သုံးစေရန် အကြမ်း ဖက်ခြင်း၊ခြိမ်းခြောက်ခြင်း၊ မလျော်ဩဇာသုံးခြင်း၊ လိမ်လည်လှည့်ဖျားခြင်း၊ လာဘ်ပေးခြင်း၊ လာဘ်ယူခြင်း ပြုလုပ်ကြောင်း ပြစ်မှုထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၆၁ ခ)'),
                  buildTableRow(
                      cell1:
                          'ရွေးကောက်ပွဲကျင်းပသည့်နေ့တွင် မဲရုံအတွင်း၊ မဲရုံမှ ကိုက် ၅၀၀ အကွာအတွင်း ရွေးကောက်ပွဲတွင် မဲမပေးရန် တိုက်တွန်းသွေးဆောင်ခြင်း ကို ကျုးလွန်လျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၆၁ ဂ)'),
                  buildTableRow(
                      cell1:
                          'မဲရုံနှင့်ကိုက် ၅၀၀ အတွင်း မဲပေးသူများ၊မဲရုံတွင်တာဝန်ကျနေသူများအား အနှောက်အယှက်ဖြစ် စေရန် အသံချဲ့စက် သို့မဟုတ် တစ်ခုခု အသုံးပြုလုပ်ဆောင်၍ စည်ကမ်းမဲ့သည့် အပြုအမူကို ပြုလုပ်ကြောင်း ပြစ်မှုထင်ရှားလျှင်',
                      cell2: '(ရွေး- ဥပဒေ ၆၂)'),
                  buildTableRow(
                      cell1: 'မဲရုံအတွင်းသို့ ခွင့်ပြုချက်မရှိဘဲဝင်ရောက်ခြင်း',
                      cell2: '(ရွေး- ဥပဒေ ၆၃)'),
                ],
              ),
              Text(
                  "မည်သူမဆိုရွေးကောက်ပွဲဆိုင်ရာပြစ်မှု များနှင့် စပ်လျဉ်း၍ လိမ်လည်တိုင်ကြားခဲ့လျှင် (၃) နှစ်ထက်မပိုသော ထောင်ဒဏ် သို့မဟုတ် သုံးသိန်းထက်မပိုသော ငွေဒဏ် သို့မဟုတ် ဒဏ်နှစ်ရပ်လုံးဖြစ်စေချမှတ်နိုင်သည်။ (ရွေး -ဥပဒေ ၆၄)"),
              Text(
                "တရားမဲ့ပြုကျင့်မှုများ",
                style: TextStyle(fontWeight: FontWeight.bold),
              ),
              Text("""
၁။ တရားမဲ့ပြုကျင့်မှုများကို ရွေးကောက်ပွဲဥပဒေ အခန်း (၁၄)၊ပုဒ်မ ၆၆တွင် အပိုဒ်ခွဲ (က) မှ (ဌ) အထိ ပြဋ္ဌာန်းထားပါသည်။
၂။ထိုအမှုများကို ကော်မရှင်မှ ခုံအဖွဲ့ဖြင့် စစ်ဆေးစီရင်နိုင်သည်။
၃။ ရွေးကောက်ပွဲ အနိုင်/ အရှုံးရလဒ်ကို မကျေနပ်လျှင် ကော်မရှင်ကို ကန့်ကွက်လွှာတင်သွင်းနိုင်သည်။
(က) အဖွဲ့ဝင် (၃)ဦးပါသော ခုံအဖွဲ့ ဖြင့် စစ်ဆေးဆုံးဖြတ်သည်။
(ခ) ခုံအဖွဲ့၏ ဆုံးဖြတ်ချက်ကို မကျေနပ်လျှင် ကော်မရှင်ကို အယူခံတင်နိုင်သည်။
(ဂ) ရွေးကောက်ခံရသည့် ကိုယ်စားလှယ်သည် ရွေးကောက်ပွဲတွင် တရားမဲ့ ပြုကျင့်ခဲ့ကြောင်း ပေါ်ပေါက်လျှင် ယင်းအား ရွေးကောက်တင်မြှောက်ခြင်း ပျက်ပြယ်ကြောင်းဆုံးဖြတ်ပြီး ကိုယ်စားလှယ်အဖြစ်မှ ပယ်ဖျက်နိုင်သည်။
(ဃ) ကော်မရှင်၏ ဆုံးဖြတ်ချက်သည် အပြီးအပြတ်ဖြစ်သည်။

ပုဒ်မ ၆၆။	အောက်ပါတို့သည် တရားမဲ့ပြုကျင့်မှုများဖြစ်သည်-
(က)	လွှတ်တော်ကိုယ်စားလှယ်လောင်းကဖြစ်စေ၊ ယင်း၏ရွေးကောက်ပွဲကိုယ်စားလှယ်ကဖြစ်စေ၊ 
		ယင်းတို့တစ်ဦးဦး၏သဘောတူညီချက်ဖြင့် အခြားသူတစ်ဦးဦးကဖြစ်စေ-
		(၁)	လာဘ်ပေး လာဘ်ယူမှုပြုလုပ်ခြင်း၊
		(၂)	ရွေးကောက်မှုဆိုင်ရာ အခွင့်အရေးကို အနှောင့်အယှက်ပြုလုပ်ခြင်း၊
		(၃)	သူတစ်ပါး အယောင်ဆောင်ခြင်း၊
		(၄)	မဟုတ်မမှန်ပြောဆိုကြေညာခြင်း၊
		(၅)	မဟုတ်မမှန်ဝန်ခံလက်မှတ်ရေးထိုးခြင်း။
	(ခ)	မဲဆန္ဒနယ်တစ်နယ်အတွင်း ရွေးကောက်ပွဲတွင် တစ်ကြိမ်ထက်ပို၍ ဆန္ဒမဲပေးခြင်း သို့မဟုတ် 
		ရွေးကောက်ပွဲများကို တစ်ချိန်တည်းကျင်းပစဉ် တစ်နယ်ထက်ပိုသော မဲဆန္ဒနယ်များအတွက်
		ဆန္ဒမဲပေးခြင်းဖြင့် မိမိလိုလားသောလွှတ်တော်ကိုယ်စားလှယ်လောင်းအား အကျိုးရှိစေခြင်း၊
	(ဂ)	လွှတ်တော်ကိုယ်စားလှယ်ကသော်လည်းကောင်း၊ ယင်း၏ရွေးကောက်ပွဲကိုယ်စားလှယ်က 
		သော်လည်းကောင်း ရွေးကောက်ပွဲဆိုင်ရာ ကုန်ကျစရိတ်နှင့်စပ်လျဉ်း၍ သတ်မှတ်ချက်နှင့်
		မညီညွတ်သော အသုံးစရိတ်များကျခံသုံးစွဲခြင်း သို့မဟုတ် ယင်းသို့ကျခံသုံးစွဲရန် သဘော
		တူညီခြင်း၊
	(ဃ)	ရွေးကောက်ပွဲဆိုင်ရာ ကုန်ကျစရိတ်ငွေစာရင်းများကို ရွေးကောက်ပွဲကိုယ်စားလှယ်က သတ်
		မှတ်ထားသည့်အတိုင်း ရေးမှတ်ထားရန် ပျက်ကွက်ခြင်း၊
	(င)	လွှတ်တော်ကိုယ်စားလှယ်လောင်း သို့မဟုတ် ယင်း၏ရွေးကောက်ပွဲကိုယ်စားလှယ်၏ တိုက်
		တွန်းချက်ဖြင့်သော်လည်းကောင်း၊ သဘောတူညီချက်ဖြင့်သော်လည်းကောင်း -
		(၁)	လွှတ်တော်ကိုယ်စားလှယ်လောင်းအဖြစ်ပါဝင်ရန် သို့မဟုတ် မပါဝင်ဘဲနေရန် သို့မ
			ဟုတ် လွှတ်တော်ကိုယ်စားလှယ်အဖြစ်မှနုတ်ထွက်ရန် ရည်ရွယ်ချက်ဖြင့်ဖြစ်စေ၊ ကျေး
			ဇူးတုံ့ပြန်ချက်ဖြင့်ဖြစ်စေ တစ်ဦးတစ်ယောက်သောသူက လာဘ်လာဘလက်ခံခြင်း သို့
			မဟုတ် လာဘ်လာဘလက်ခံရန် သဘောတူခြင်း၊
		(၂)	ဆန္ဒမဲပေးရန် သို့မဟုတ် ဆန္ဒမဲမပေးဘဲနေရန် မဲဆန္ဒရှင်တစ်ဦးဦးကို သွေးဆောင်ရန်
			ဖြစ်စေ၊ သွေးဆောင်လိုသဖြင့် အားထုတ်ရန်ဖြစ်စေ တစ်ဦးတစ်ယောက်သောသူက
			မိမိအတွက် သို့မဟုတ် သူတစ်ပါးအတွက် လာဘ်လာဘလက်ခံရန် သဘောတူခြင်း။
	(စ)	မမှန်မကန်ပြုလုပ်ထားသော ရွေးကောက်ပွဲဆိုင်ရာ ကုန်ကျစရိတ်ငွေစာရင်းကို တင်ပြခြင်း သို့
		မဟုတ် ထိုကဲ့သို့ရွေးကောက်ပွဲဆိုင်ရာ ကုန်ကျစရိတ် ငွေစာရင်းကို မှန်ကန်သည်ဟု ဝန်ခံခြင်း 
		သို့မဟုတ် သတ်မှတ်ထားသည့်အတိုင်း တင်သွင်းရန် ပျက်ကွက်ခြင်း၊
	(ဆ)	လွှတ်တော်ကိုယ်စားလှယ်လောင်းမဟုတ်သော သို့မဟုတ် ယင်း၏ ရွေးကောက်ပွဲ ကိုယ်စား
		လှယ်မဟုတ်သော အခြားသူတစ်ဦးဦးက ယင်းလွှတ်တော်ကိုယ်စားလှယ်လောင်း၏ ခွင့်ပြု
		ချက်မရှိဘဲ လွှတ်တော်ကိုယ်စားလှယ်အဖြစ် ရွေးကောက်တင်မြှောက်ခံရစေရန်ဖြစ်စေ၊ ရွေး 
		ကောက်တင်မြှောက်ခံရရေးအတွက် အားပေးလိုသောကြောင့်ဖြစ်စေ အစည်းအဝေးကျင်းပ
		၍ သော်လည်းကောင်း၊ စာရွက်စာတမ်းများ ဝေငှ၍ သော်လည်းကောင်း၊ အခြားတစ်နည်း 
		နည်းဖြင့်သော်လည်းကောင်း ငွေအကုန်အကျခံခြင်း သို့မဟုတ် ကုန်ကျရန် ခွင့်ပြုခြင်း၊
	(ဇ)	ပုံနှိပ်သူ၊ ထုတ်ဝေသူတို့၏ အမည်နေရပ်မပါရှိသော ရွေးကောက်ပွဲနှင့်သက်ဆိုင်သည့်ကြော်
		ငြာ၊ စာရွက်စာတမ်း၊ ပိုစတာ စသည်တို့ကို ဖြန့်ချီထုတ်ဝေခြင်းဖြင့် မိမိလိုလားသော လွှတ်တော်
		ကိုယ်စားလှယ်လောင်းအား အကျိုးရှိစေခြင်း၊
	(ဈ)	လွှတ်တော်ကိုယ်စားလှယ်လောင်း သို့မဟုတ် ယင်း၏ ရွေးကောက်ပွဲကိုယ်စားလှယ်၏ တိုက်
		တွန်းချက်ဖြင့်သော်လည်းကောင်း၊ သဘောတူညီချက်ဖြင့်သော်လည်းကောင်း မဲဆန္ဒရှင်က 
		ဆန္ဒမဲပေးချိန်တွင် မိမိ၏ဆန္ဒမဲလက်မှတ်ကို မဲရုံမှအခြားသို့ ယူဆောင်သွားခြင်း၊
	(ည)	လွှတ်တော်ကိုယ်စားလှယ်လောင်း သို့မဟုတ် ယင်း၏ရွေးကောက်ပွဲ ကိုယ်စားလှယ်ကဖြစ်စေ၊
		ယင်းတို့တစ်ဦးဦး၏ သဘောတူညီချက်အရ အခြားသူ တစ်ဦးကဖြစ်စေ လွှတ်တော်ကိုယ်စား
		လှယ်လောင်းတစ်ဦး ရွေးကောက်တင်မြှောက်ခံရရေးအတွက် အကူအညီကို ဝန်ထမ်းတစ်ဦးဦး
		ထံမှရယူခြင်း၊ ရယူရန်အားပေးကူညီခြင်း သို့မဟုတ် ရယူရန် အားထုတ်ခြင်း၊
	(ဋ)	လွှတ်တော်ကိုယ်စားလှယ်လောင်းတစ်ဦး ရွေးကောက်တင်မြှောက်ခံရရေးအတွက် ဘာသာရေး 
		အထိမ်းအမှတ်များကို ရွေးကောက်ပွဲတွင် အသုံးပြုခြင်း သို့မဟုတ် လူမျိုးကိုဖြစ်စေ၊ ကိုးကွယ်ရာ
		ဘာသာကိုဖြစ်စေ အကြောင်းပြု မဲပေးကြရန် သို့မဟုတ် မဲမပေးဘဲနေကြရန် အစီအစဉ်ပြုလျက်
		လှုံ့ဆော်ခြင်း၊
	(ဌ)	လွှတ်တော်ကိုယ်စားလှယ်လောင်းတစ်ဦး ရွေးကောက်တင်မြှောက်ခံရရေးအတွက် ပါတီတစ်ခု
		ခုကိုဖြစ်စေ၊ ပုဂ္ဂိုလ်တစ်ဦးဦးကိုဖြစ်စေ အကြမ်းဖက်ခြင်း၊ မမှန်မကန် စွပ်စွဲခြင်း၊ ရေးသားခြင်း၊ 
		အများပြည်သူ ဆူပူမှုဖြစ်အောင်ဖန်တီးခြင်း။
              """)
            ],
          ),
        ));
  }

  TableRow buildTableRow({String cell1, String cell2}) {
    return TableRow(children: [
      TableCell(
          child: Padding(
        padding: const EdgeInsets.all(8.0),
        child: Text(cell1),
      )),
      TableCell(
        child: Padding(
          padding: const EdgeInsets.all(8.0),
          child: Text(cell2),
        ),
      ),
    ]);
  }
}
